reubenlavin08/VL53L8CX-ESP32-Pre-Assistive-Helmet-Sensor-Integration-/tof_pin_test/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Match the helmet firmware's driver config — these are what the ToF bring-up
# was verified against.
CONFIG_VL53L8CX_RESET_PIN_LOW=y
CONFIG_VL53L8CX_I2C_TIMEOUT=y
CONFIG_VL53L8CX_I2C_TIMEOUT_VALUE=100
CONFIG_VL53L8CX_NB_TARGET_PER_ZONE=1

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000
